### Assignment - 2
Below is the Assignment-2 image:

![Assignment-2 Screenshot](Assignment-2.png)

### Assignment: Create dataset, locate rows, read/display CSV

Tasks:
1. Create a dataset with columns:
   - Tid, Refund, Marital Status, Taxable Income, Cheat
2. Locate rows 0, 4, 7 and 8 using DataFrame indexing.
3. Save to CSV, read the CSV back, and display it.

Notes:
- Taxable Income will be stored as integers (e.g., 125000).
- If values are like "125k", example code shows how to convert them to integer.

In [ ]:
import pandas as pd

# 1) Create the dataset (10 rows)
data = {
    'Tid': [1,2,3,4,5,6,7,8,9,10],
    'Refund': ['No','No','No','No','Yes','No','No','Yes','No','Yes'],
    'Marital Status': [
        'Single','Married','Single','Married','Divorced','Married','Divorced',
        'Single','Married','Single'],
    # Taxable Income as integers (in rupees)
    'Taxable Income': [
        125000, 100000, 70000, 120000, 95000, 60000, 220000, 85000, 75000, 90000],
    'Cheat': ['No','No','No','No','Yes','No','No','Yes','No','Yes']
}

df = pd.DataFrame(data)

# show the full DataFrame
df

   Tid Refund Marital Status  Taxable Income Cheat
0    1     No         Single          125000    No
1    2     No        Married          100000    No
2    3     No         Single           70000    No
3    4     No        Married          120000    No
4    5    Yes       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7     No       Divorced          220000    No
7    8    Yes         Single           85000   Yes
8    9     No        Married           75000    No
9   10    Yes         Single           90000   Yes

In [2]:
#2 locate rows 0, 4, 7, 8 using dataframe indexing (by position)
rows_by_position = df.iloc[[0, 4, 7, 8]]
rows_by_position

   Tid Refund Marital Status  Taxable Income Cheat
0    1     No         Single          125000    No
4    5    Yes       Divorced           95000   Yes
7    8    Yes         Single           85000   Yes
8    9     No        Married           75000    No

In [3]:
#3 Save to CSV
csv_path = "assignment_table.csv"
df.to_csv(csv_path, index=False)   # index=False so file doesn't contain the DataFrame index column

# Read the CSV back and display
df_from_csv = pd.read_csv(csv_path)
df_from_csv

   Tid Refund Marital Status  Taxable Income Cheat
0    1     No         Single          125000    No
1    2     No        Married          100000    No
2    3     No         Single           70000    No
3    4     No        Married          120000    No
4    5    Yes       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7     No       Divorced          220000    No
7    8    Yes         Single           85000   Yes
8    9     No        Married           75000    No
9   10    Yes         Single           90000   Yes